docs: update miner documentation for local eval
